#### [`repos-official-new`] Terraform Plan 📖`success`

<a href="https://app.terraform.io/app/cdktf-team/prebuilt-providers-official-new/runs/run-gtqnezPzNQ7HomVM" target="_blank">Remote Plan Link ↗️</a>

<details><summary>Show Plan</summary>

```tf
[command]/home/runner/work/_temp/72b967cb-76b7-4e9e-9de0-9ba595e6e36a/terraform-bin plan -no-color
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/cdktf-team/prebuilt-providers-official-new/runs/run-gtqnezPzNQ7HomVM

Waiting for the plan to start...

Terraform v1.3.1
on linux_amd64
Initializing plugins and modules...
data.github_team.reposofficialnew_cdktfteamcdktf_4A2C9F8E: Reading...
data.github_team.reposofficialnew_cdktfteamcdktf_4A2C9F8E: Read complete after 6s [id=6602018]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_repository_file.reposofficialnew_cdktfprovideradgo_repositorysetup_codeowners_0B55F8B4 will be created
  + resource "github_repository_file" "reposofficialnew_cdktfprovideradgo_repositorysetup_codeowners_0B55F8B4" {
      + branch              = "main"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = (known after apply)
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # These owners will be the default owners for everything in 
            # the repo. Unless a later match takes precedence, 
            # they will be requested for review when someone opens a 
            # pull request.
            *       @cdktf/tf-cdk-team
        EOT
      + file                = ".github/CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + repository          = "cdktf-provider-ad-go"
      + sha                 = (known after apply)
    }

  # github_repository_file.reposofficialnew_cdktfproviderazurestackgo_repositorysetup_codeowners_AFD3BC8B will be created
  + resource "github_repository_file" "reposofficialnew_cdktfproviderazurestackgo_repositorysetup_codeowners_AFD3BC8B" {
      + branch              = "main"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = (known after apply)
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # These owners will be the default owners for everything in 
            # the repo. Unless a later match takes precedence, 
            # they will be requested for review when someone opens a 
            # pull request.
            *       @cdktf/tf-cdk-team
        EOT
      + file                = ".github/CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + repository          = "cdktf-provider-azurestack-go"
      + sha                 = (known after apply)
    }

  # github_repository_file.reposofficialnew_cdktfproviderboundarygo_repositorysetup_codeowners_9C663681 will be created
  + resource "github_repository_file" "reposofficialnew_cdktfproviderboundarygo_repositorysetup_codeowners_9C663681" {
      + branch              = "main"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = (known after apply)
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # These owners will be the default owners for everything in 
            # the repo. Unless a later match takes precedence, 
            # they will be requested for review when someone opens a 
            # pull request.
            *       @cdktf/tf-cdk-team
        EOT
      + file                = ".github/CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + repository          = "cdktf-provider-boundary-go"
      + sha                 = (known after apply)
    }

  # github_repository_file.reposofficialnew_cdktfproviderconsulgo_repositorysetup_codeowners_0D10F9E1 will be created
  + resource "github_repository_file" "reposofficialnew_cdktfproviderconsulgo_repositorysetup_codeowners_0D10F9E1" {
      + branch              = "main"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = (known after apply)
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # These owners will be the default owners for everything in 
            # the repo. Unless a later match takes precedence, 
            # they will be requested for review when someone opens a 
            # pull request.
            *       @cdktf/tf-cdk-team
        EOT
      + file                = ".github/CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + repository          = "cdktf-provider-consul-go"
      + sha                 = (known after apply)
    }

  # github_repository_file.reposofficialnew_cdktfproviderdnsgo_repositorysetup_codeowners_F3974DE9 will be created
  + resource "github_repository_file" "reposofficialnew_cdktfproviderdnsgo_repositorysetup_codeowners_F3974DE9" {
      + branch              = "main"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = (known after apply)
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # These owners will be the default owners for everything in 
            # the repo. Unless a later match takes precedence, 
            # they will be requested for review when someone opens a 
            # pull request.
            *       @cdktf/tf-cdk-team
        EOT
      + file                = ".github/CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + repository          = "cdktf-provider-dns-go"
      + sha                 = (known after apply)
    }

  # github_repository_file.reposofficialnew_cdktfprovidergoogleworkspacego_repositorysetup_codeowners_0F62E1CE will be created
  + resource "github_repository_file" "reposofficialnew_cdktfprovidergoogleworkspacego_repositorysetup_codeowners_0F62E1CE" {
      + branch              = "main"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = (known after apply)
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # These owners will be the default owners for everything in 
            # the repo. Unless a later match takes precedence, 
            # they will be requested for review when someone opens a 
            # pull request.
            *       @cdktf/tf-cdk-team
        EOT
      + file                = ".github/CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + repository          = "cdktf-provider-googleworkspace-go"
      + sha                 = (known after apply)
    }

  # github_repository_file.reposofficialnew_cdktfproviderhcpgo_repositorysetup_codeowners_2018E26B will be created
  + resource "github_repository_file" "reposofficialnew_cdktfproviderhcpgo_repositorysetup_codeowners_2018E26B" {
      + branch              = "main"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = (known after apply)
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # These owners will be the default owners for everything in 
            # the repo. Unless a later match takes precedence, 
            # they will be requested for review when someone opens a 
            # pull request.
            *       @cdktf/tf-cdk-team
        EOT
      + file                = ".github/CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + repository          = "cdktf-provider-hcp-go"
      + sha                 = (known after apply)
    }

  # github_repository_file.reposofficialnew_cdktfproviderhcsgo_repositorysetup_codeowners_6DE68C86 will be created
  + resource "github_repository_file" "reposofficialnew_cdktfproviderhcsgo_repositorysetup_codeowners_6DE68C86" {
      + branch              = "main"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = (known after apply)
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # These owners will be the default owners for everything in 
            # the repo. Unless a later match takes precedence, 
            # they will be requested for review when someone opens a 
            # pull request.
            *       @cdktf/tf-cdk-team
        EOT
      + file                = ".github/CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + repository          = "cdktf-provider-hcs-go"
      + sha                 = (known after apply)
    }

  # github_repository_file.reposofficialnew_cdktfproviderhttpgo_repositorysetup_codeowners_17ECAF8D will be created
  + resource "github_repository_file" "reposofficialnew_cdktfproviderhttpgo_repositorysetup_codeowners_17ECAF8D" {
      + branch              = "main"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = (known after apply)
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # These owners will be the default owners for everything in 
            # the repo. Unless a later match takes precedence, 
            # they will be requested for review when someone opens a 
            # pull request.
            *       @cdktf/tf-cdk-team
        EOT
      + file                = ".github/CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + repository          = "cdktf-provider-http-go"
      + sha                 = (known after apply)
    }

  # github_repository_file.reposofficialnew_cdktfprovidernomadgo_repositorysetup_codeowners_49DFA75E will be created
  + resource "github_repository_file" "reposofficialnew_cdktfprovidernomadgo_repositorysetup_codeowners_49DFA75E" {
      + branch              = "main"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = (known after apply)
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # These owners will be the default owners for everything in 
            # the repo. Unless a later match takes precedence, 
            # they will be requested for review when someone opens a 
            # pull request.
            *       @cdktf/tf-cdk-team
        EOT
      + file                = ".github/CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + repository          = "cdktf-provider-nomad-go"
      + sha                 = (known after apply)
    }

  # github_repository_file.reposofficialnew_cdktfprovideropcgo_repositorysetup_codeowners_F13612D8 will be created
  + resource "github_repository_file" "reposofficialnew_cdktfprovideropcgo_repositorysetup_codeowners_F13612D8" {
      + branch              = "main"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = (known after apply)
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # These owners will be the default owners for everything in 
            # the repo. Unless a later match takes precedence, 
            # they will be requested for review when someone opens a 
            # pull request.
            *       @cdktf/tf-cdk-team
        EOT
      + file                = ".github/CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + repository          = "cdktf-provider-opc-go"
      + sha                 = (known after apply)
    }

  # github_repository_file.reposofficialnew_cdktfprovideroraclepaasgo_repositorysetup_codeowners_636D8D40 will be created
  + resource "github_repository_file" "reposofficialnew_cdktfprovideroraclepaasgo_repositorysetup_codeowners_636D8D40" {
      + branch              = "main"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = (known after apply)
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # These owners will be the default owners for everything in 
            # the repo. Unless a later match takes precedence, 
            # they will be requested for review when someone opens a 
            # pull request.
            *       @cdktf/tf-cdk-team
        EOT
      + file                = ".github/CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + repository          = "cdktf-provider-oraclepaas-go"
      + sha                 = (known after apply)
    }

  # github_repository_file.reposofficialnew_cdktfprovidersalesforcego_repositorysetup_codeowners_11F16FA7 will be created
  + resource "github_repository_file" "reposofficialnew_cdktfprovidersalesforcego_repositorysetup_codeowners_11F16FA7" {
      + branch              = "main"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = (known after apply)
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # These owners will be the default owners for everything in 
            # the repo. Unless a later match takes precedence, 
            # they will be requested for review when someone opens a 
            # pull request.
            *       @cdktf/tf-cdk-team
        EOT
      + file                = ".github/CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + repository          = "cdktf-provider-salesforce-go"
      + sha                 = (known after apply)
    }

  # github_repository_file.reposofficialnew_cdktfprovidervspherego_repositorysetup_codeowners_D8EA900F will be created
  + resource "github_repository_file" "reposofficialnew_cdktfprovidervspherego_repositorysetup_codeowners_D8EA900F" {
      + branch              = "main"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = (known after apply)
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # These owners will be the default owners for everything in 
            # the repo. Unless a later match takes precedence, 
            # they will be requested for review when someone opens a 
            # pull request.
            *       @cdktf/tf-cdk-team
        EOT
      + file                = ".github/CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + repository          = "cdktf-provider-vsphere-go"
      + sha                 = (known after apply)
    }

Plan: 14 to add, 0 to change, 0 to destroy.

::debug::Terraform exited with code 0.
::debug::stderr: 
::debug::exitcode: 0


::set-output name=stderr::

::set-output name=exitcode::0

```

</details>

*Pusher: @mutahhir, Action: `pull_request`, Working Directory: ``, Workflow: `Plan`*